In [1]:
import numpy as np
import pandas as pd

animals = pd.read_csv(r'C:\Users\Yael Aguilar\Downloads\animals.csv')
animals.index.values

array([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15, 16,
       17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33,
       34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50,
       51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61], dtype=int64)

In [2]:
animals.head()

   brainwt   bodywt      animal
0    3.385   44.500  Arctic_fox
1    0.480   15.499  Owl_monkey
2    1.350    8.100      Beaver
3  464.983  423.012         Cow
4   36.328  119.498   Gray_wolf

In [3]:
animals['bodywt']

0      44.500
1      15.499
2       8.100
3     423.012
4     119.498
       ...
57    169.000
58      2.600
59     11.400
60      2.500
61     50.400
Name: bodywt, Length: 62, dtype: float64

In [4]:
animals.brainwt

0       3.385
1       0.480
2       1.350
3     464.983
4      36.328
       ...
57    160.004
58      0.900
59      1.620
60      0.104
61      4.235
Name: brainwt, Length: 62, dtype: float64

In [12]:
animals[::-1]

    brainwt   bodywt           animal
61    4.235   50.400          Red_fox
60    0.104    2.500       Tree_shrew
59    1.620   11.400        Phalanger
58    0.900    2.600           Tenrec
57  160.004  169.000  Brazilian_tapir
..      ...      ...              ...
4    36.328  119.498        Gray_wolf
3   464.983  423.012              Cow
2     1.350    8.100           Beaver
1     0.480   15.499       Owl_monkey
0     3.385   44.500       Arctic_fox

[62 rows x 3 columns]

In [17]:
animals.loc[0:6, 'bodywt']

0     44.500
1     15.499
2      8.100
3    423.012
4    119.498
5    114.996
6     98.199
Name: bodywt, dtype: float64

In [20]:
animals.iloc[0:10, 0:1]

   brainwt
0    3.385
1    0.480
2    1.350
3  464.983
4   36.328
5   27.660
6   14.831
7    1.040
8    4.190
9    0.425

In [21]:
animals.loc[0:5,['animal', 'bodywt']]

       animal   bodywt
0  Arctic_fox   44.500
1  Owl_monkey   15.499
2      Beaver    8.100
3         Cow  423.012
4   Gray_wolf  119.498
5        Goat  114.996

In [31]:
animals[(animals.bodywt > 10) & (animals.animal == 'Owl_monkey')]['animal']

1    Owl_monkey
Name: animal, dtype: object